Revit 2027 API
RebarShapeDrivenAccessor.SetRebarShapeId Method
 Changes the RebarShape element that defines the shape of the rebar. Changing the value of this member causes the Rebar instance to choose values for its shape parameters to preserve its previous shape as closely as possible
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetRebarShapeId(
	ElementId shapeId
)
Public Sub SetRebarShapeId (
	shapeId As ElementId
)
public:
void SetRebarShapeId(
	ElementId^ shapeId
)
member SetRebarShapeId :
        shapeId : ElementId -> unit
Parameters
shapeId ElementId
Exceptions
Exception | Condition
ArgumentException |  shapeId is not the id of a RebarShape in the document.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This RebarShapeDrivenAccessor doesn't contain a valid rebar reference.
See Also
Reference
RebarShapeDrivenAccessor Class
Autodesk.Revit.DB.Structure Namespace